---
kind: method
id: M:Autodesk.Revit.DB.Visual.AppearanceAssetEditScope.#ctor(Autodesk.Revit.DB.Document)
source: html/05e8579d-1bdd-277c-7aae-603de552cbe1.htm
---
# Autodesk.Revit.DB.Visual.AppearanceAssetEditScope.#ctor Method

Constructs a new instance of an AppearanceAssetEditScope.

## Syntax (C#)
```csharp
public AppearanceAssetEditScope(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document for which this EditScope is going to be used.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null